OpenFOAM/BFS_DR/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
61440
(
4.53704e-09
3.24877e-09
3.2279e-09
2.26368e-09
2.26512e-09
2.94864e-09
4.40959e-09
9.74689e-09
...
)
;

boundaryField
{
    bottomWall
    {
        type            zeroGradient;
    }
    topWall
    {
        type            zeroGradient;
    }
    sides1
    {
        type            cyclic;
    }
    sides2
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
