OpenFOAM/BFS_DR/Allrun
#!/bin/sh

cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions
#------------------------------------------------------------------------------ 

runApplication blockMesh
#runApplication topoSet
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

touch backwardFacingStep.foam
rm -rf processor*
chmod 744 *

exit

#------------------------------------------------------------------------------
