OpenFOAM/BFS_DR/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    /*{
        name    inletFaceSet;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name    inlet;
        }
    }
    {
        name    inletCellSet;
        type    cellSet;
        action  new;
        source  faceToCell;
        sourceInfo
        {
            set     inletFaceSet;
            option  any;
        }
    }
    {
        name    inletCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     inletCellSet;
        }
    }*/
    {
        name    channelCell;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box     (-9.4 0 0)(-3.0 2.0 3.2);
        }
    }
    {
        name    channelCellZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set     channelCell;
        }
    }
);

// ************************************************************************* //
